Tekla.Structures.Catalogs.CatalogObjectTypeEnum
The catalog object type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.PART
The part type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.STEEL_BEAM
The steel beam type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.STEEL_COLUMN
The steel column type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.STEEL_ORTHOGONAL_BEAM
The steel orthogonal beam type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.STEEL_TWIN_PROFILE_BEAM
The steel twin profile beam type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.STEEL_CONTOUR_PLATE
The steel contour plate type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.STEEL_FOLDED_PLATE
The steel folded plate type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.CONCRETE_BEAM
The concrete beam type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.CONCRETE_COLUMN
The concrete column type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.CONCRETE_PAD_FOOTING
The concrete pad footing type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.CONCRETE_STRIP_FOOTING
The concrete strip footing type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.CONCRETE_PANEL
The concrete panel type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.CONCRETE_SLAB
The concrete slab type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.REINFORCING_BAR
The reinforcing bar type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.SURFACING
The surfacing type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.WELD
The weld type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.BOLT
The bolt type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.STEEL_ASSEMBLY
The steel assembly type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.PRECAST_CONCRETE_ASSEMBLY
The precast concrete assembly type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.INSITU_CONCRETE_ASSEMBLY
The in situ concrete assembly type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.POUR_OBJECT
The pour object type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.POUR_BREAK
The pour break type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.GRID
The grid type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.PROJECT
The project type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.PHASE
The phase type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.TASK
The task type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.REFERENCE_MODEL
The reference model type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.REFERENCE_MODEL_OBJECT
The reference model object type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.SINGLE_PART_DRAWING
The single part drawing type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.ASSEMBLY_DRAWING
The assembly drawing type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.GA_DRAWING
The general arrangement drawing type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.MULTI_DRAWING
The multidrawing type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.CAST_UNIT_DRAWING
The cast unit drawing type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.BENT_PLATE
The bent plate type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.STEEL_BREP_PART
The steel brep part type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.CONCRETE_BREP_PART
The concrete brep part type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.CHAMFER_OBJECT
The chanfer object type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.SURFACE_OBJECT
The surface object type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.GRID_PLANE
The grid plane type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.STEEL_SPIRAL_BEAM
The steel helix part type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.CONCRETE_SPIRAL_BEAM
The concrete helix part type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.POUR_UNIT
The pour unit type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.STEEL_LOFTED_PLATE
The steel lofted plate part type.

Tekla.Structures.Catalogs.CatalogObjectTypeEnum.CONCRETE_LOFTED_SLAB
The concrete lofted slab part type.